_site/README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Description</a></li>
<li><a href="#sec-2">2. Contributors</a>
<ul>
<li><a href="#sec-2-1">2.1. LLNL</a></li>
<li><a href="#sec-2-2">2.2. University of Utah - Formal Method Group</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Support</a></li>
</ul>
</div>
</div>

# Description<a id="sec-1" name="sec-1"></a>

Reproducibility is highly desirable for parallel applications, but as
they are run on increasingly large and heterogeneous platforms,
reproducibility of numerical results or code behaviors is becoming
less and less obtainable. The same code can produce different results
or occasional failures such as a crash on different systems or even
across different runs on the same hardware. PRUNER is a research and
development project that aims at innovating scalable techniques to aid
applications to obtain the reproducibility. Specifically, our strategy
is to accomplish this by developing a multilevel analysis and control
toolset called the PRUNING toolset, which combines static and dynamic
analysis techniques to detect, control and eliminate targeted sources
of non-determinism, as introduced through parallel programming
libraries and APIs.

# Contributors<a id="sec-2" name="sec-2"></a>

## LLNL<a id="sec-2-1" name="sec-2-1"></a>

-   Dong H. Ahn (Lead)
-   Chris Chambreau
-   Gregory L. Lee
-   Ignacio Laguna
-   Kento Sato (Postdoc)
-   Martin Schulz

## University of Utah - Formal Method Group<a id="sec-2-2" name="sec-2-2"></a>

-   Simone Atzeni (Phd student)
-   Prof. Ganesh Gopalakrishnan
-   Prof. Zvonimir Rakamaric

# Support<a id="sec-3" name="sec-3"></a>

For any questions or problems please contact [Simone Atzeni](<simone@cs.utah.edu?subject=[PRUNER>] Info).